app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Francisco Javier"], ["last_name", "Torres Romero"], ["email", "javiert7ro@gmail.com"], ["created_at", "2022-09-09 03:50:51.017467"], ["updated_at", "2022-09-09 03:50:51.017467"]]
---
  def create
    @user = User.new(user_params)
    #@user.skip_confirmation_notification!

    respond_to do |format|
      if @user.save

UPDATE "users" SET "last_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["last_name", "Torres Romero2"], ["updated_at", "2022-09-09 04:01:37.885484"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)